In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Sales')

+---------+------------+------+----------+-------+
| sale_id | product_id | year | quantity | price |
+---------+------------+------+----------+-------+
|    1    |    100     | 2008 |    10    |  5000 |
|    2    |    100     | 2009 |    12    |  5000 |
|    7    |    200     | 2011 |    15    |  9000 |
+---------+------------+------+----------+-------+

In [3]:
display_table('Product')

+------------+--------------+
| product_id | product_name |
+------------+--------------+
|    100     |    Nokia     |
|    200     |    Apple     |
|    300     |   Samsung    |
+------------+--------------+

### Write an SQL query that reports the *product_name*, *year*, and *price* for each *sale_id* in the Sales table..

```
+--------------+-------+-------+
| product_name | year  | price |
+--------------+-------+-------+
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |
+--------------+-------+-------+
```

In [4]:
%%sql 

SELECT product_name, year, price
FROM Product p 
JOIN Sales s ON s.product_id = p.product_id

[('Nokia', 2008, 5000), ('Nokia', 2009, 5000), ('Apple', 2011, 9000)]

# Using Pandas

In [5]:
product_query = %sql SELECT * FROM Product
sales_query = %sql SELECT * FROM Sales

product_df = product_query.DataFrame()
sales_df = sales_query.DataFrame()

display(product_df, sales_df)

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

## merge()

In [6]:
pd.merge(product_df, sales_df)

   product_id product_name  sale_id  year  quantity  price
0         100        Nokia        1  2008        10   5000
1         100        Nokia        2  2009        12   5000
2         200        Apple        7  2011        15   9000

In [7]:
pd.merge(product_df, sales_df)[['product_name', 'year', 'price']] \
    .set_index('product_name', drop=True)

              year  price
product_name
Nokia         2008   5000
Nokia         2009   5000
Apple         2011   9000

# join()

In [8]:
product_df.set_index('product_id').join(sales_df.set_index('product_id'))

           product_name  sale_id    year  quantity   price
product_id
100               Nokia      1.0  2008.0      10.0  5000.0
100               Nokia      2.0  2009.0      12.0  5000.0
200               Apple      7.0  2011.0      15.0  9000.0
300             Samsung      NaN     NaN       NaN     NaN

In [9]:
product_df.set_index('product_id').join(sales_df.set_index('product_id'), how='right')

           product_name  sale_id  year  quantity  price
product_id
100               Nokia        1  2008        10   5000
100               Nokia        2  2009        12   5000
200               Apple        7  2011        15   9000

In [10]:
product_df.set_index('product_id').join(sales_df.set_index('product_id'), how='right') \
        [['product_name', 'year', 'price']] \
        .set_index('product_name', drop=True)

              year  price
product_name
Nokia         2008   5000
Nokia         2009   5000
Apple         2011   9000